[{"id":"rec3WyZbHgdVtzyJd","name":"2019 in review","definition":"2019 was pretty great. here are the highlights:\n\n1. found someone i loved\n2. we moved in together\n3. into a house that i bought\n4. got promoted\n5. at a job that i continue to love\n6. worked very hard\n7. hit 5k MRR across all my various projects\n8. signed my first four-digit software contract\n9. *and* my first five-digit software contract\n10. read (and listened to) a lot of books\n11. stayed in relatively good shape\n12. perfected my allspice old-fashioned recipe\n\ni only really accomplished one of my resolutions from last year (getting spoonbill to breakeven), which is...fine. i think resolutions work better for me as compasses rather than waypoints: i don’t need a specific GPS coordinate, i just need a handful of true norths.\n\na lot of 2019 (outside of my relationship with my partner) was about working pretty hard in lieu of more leisurely stuff.  i was bad at texting people back; i was bad at playing video games. i don’t *regret* this exactly — it got me to where i was trying to go! — but i think this year i want to course correct a bit.\n\nthe truth is, i know i’m going to do a bunch of work stuff. it seems silly to plan that out and assign myself goals and KPIs or whatever — the work is going to be there regardless, and it’s going to get done.\n\nfor buttondown, that is mostly around getting it into a more scalable and sustainable place.  i wrote last year about buttondown’s growth hurting my life in the way freemium apps tend to — as is the cliche, the demand (or burden, or whatever noun you care to use) of free users is pretty high, and without hiring a customer service person it sucks some joy out of my life.  i’m going to move it to a purely premium model, work on improving some of the core experiences (namely the writing and editing interface), and move it in a *slightly* more legitimate direction with support for captcha, internationalization, and webhooks.\n\nfor spoonbill, this is mostly sales and product development stuff.  i’ll be introducing “spoonbill for power users” (my friends have advised me not to actually call it that, but we’ll see), which will have support for real-time notifications, searches, and zapier support.  and then add a bunch more social networks (if you know anyone at linkedin who is up for a friendly chat, let me know...).  and then redo the email design because boy is it ugly.\n\nand, of course, the third big side project in my life is my house.  the house is a very cute craftsman with a hellish basement that just got flooded with a half-inch of water.  i would like to finish the basement and redo the bathroom and figure out what we’re going to do with a guest-room-slash-walkin-closet.  also the basement stairs are currently made out of plywood, which should...not be the case.\n\nbecause i am sociopathic, i have all of these things planned out with due dates. but that’s more about limiting the analysis paralysis (buttondown has **400** open issues on github right now) and focusing my efforts on what I think will be a combination of highest impact and most fun to work on, rather than like, “oh I gotta hit $10k mrr this year.”)\n\ni want to focus on the things that i otherwise wouldn’t do.  in 2020, i want to focus on the things that i tend to be bad about making time or space for in my life but that i never regret doing:\n\n1. cooking and making cocktails (gonna try for one new recipe a month for each)\n2. hosting friends (i am still okay with being bad at texting and communication, but i need to be better at replacing that with spending time with the people whom i care about)\n3. running and lifting.  i’ve been in a holding pattern with lifting recently (maintaining but not really improving my numbers) and i think hitting a two-plate bench would be fun.\n4. drinking tea\n5. reading poetry\n\nand if i do none of these things, that is completely fine.  i have found myself the past two months aghast at my luck and privilege.  this is the first time i have been so conscious (or self-conscious) of how good i have it; i think things can be even better, but if all twelve months of 2020 are like the worst month of 2019 i will consider myself prudent and blessed.","date":"2019-12-31"},{"id":"recsWOHQpHBzbHgqB","name":"Being 26, in review","definition":"hello!\n\ni turned 27 last week.  for a long time, i wrote about my birthdays; i took last year off [^1]. it seems weird to do one of these annual posts both for my birthday and for the [ending of the year](https://jmduke.com/2018/12/31/2018), but also i want to indulge a little: i would like to write again about my birthday, and to engage in some solipsism. \n\n---\n\ni spent 26 being the most professionally engaged and energized i've been in my entire life: \n\n- my job, which i've written little about, is terrific.  i love what i am working on; i love the people i work with (and, for reasons passing understanding, they tolerate me); i find it hard to leave the office for the first time in my life.\n- my side projects are doing tremendously well.  i wrote two years ago that if buttondown ever hit four digits MRR i would be ecstatic past the point of comprehension; both buttondown and spoonbill (the latter of which i have written very little about) are on track to end this year with \u003e2K MRR. this is wild to me.\n- i am no longer consulting, because i don't have the time or energy.  but that's probably for the best; it feels correct to spend what i can on things that yield compounding value.\n\n---\n\ni bought a house! i can't believe i bought a house.  i spent the entire time in closing terrified and certain that i would receive a call from my lender or the seller or the government saying \"just kidding, you will not be receiving a house, you are not worthy.\" it is only when i was handed the keys that this feeling only _slightly_ diminished; even now, i will wake up in the middle of the night, keenly aware that i have somehow pulled a con on the world — convinced everyone for _just_ long enough that i am not in fact three preteens in a trenchcoat, emotionally speaking, just long enough for them to give me a house.\n\nhaving a house is very nice. people counseled me that it's another job in of itself, which is true.  there are so many things to do: some foundation work; the kitchen is ghastly and needs retiling; the basement needs finishing and i now have a yard that needs, uh, yard work.  \n\nbut none of that is stressful.  i woke up the first morning of Being A House Owner, up in Roosevelt, in a place quieter and more vaguely urbane than the neighborhood of Capitol Hill where I had spent my past five years.  it immediately felt _correct_ in the way all of my really good big decisions have felt.  when i shuffle around the eighty-year-old floors on a quiet thursday morning, waiting for the coffee to brew, i think two things that i have decided are in fact _not_ contradictory:\n\n- there is so much to be done\n- it is perfect\n\n---\n\ni have been reading a lot, \"reading\" being inclusive of audiobooks.  the count is somewhere in the thirties, which is not important — quantity does not matter.  i've been bad at carving out time for reading; i've been relying, mostly successfully, on reading time being thrust upon me as if part of the hero's journey — on pleasant and quiet train rides, on sunny afternoons in the park, on planes to Japan.\n\n---\n\ni have been writing very little.  i think 26 is the year of Limited Creative Output.  part of this has been, i think, a surplus of energy being spent on all of those lovely professional things; part of this, though, has just been muscular atrophy.  i don't have a good sense of why to write or how to write or when to write, all of which is solved by opening more empty textboxes.\n\ni have been tweeting and social media-ing very little as well.  i have some amount of regret here — i love my internet circles, and they have brought me much joy and wisdom — but i find myself retreating further and further from talking on the internet. i get stressed out by waking up to missed texts, DMs, tweets and emails; i get peace by responding in daily batches, as if going through that day's mail.  \"slow discourse\" — talking with people on the phone and over coffee/tea/beer/cocktails, and doing things without a sense of traffic flying overhead, feels much better and much more sustainable.\n\n---\n\ni am very happy, and i have reason to be. \n\nthere are days where i catch myself unhappy — days where what my partner and i refer to as \"work brain\" takes over, and i can't quite get myself off of the hamster wheel of productivity and puritanic work ethic.  the problem, i think, with engineering your life to maximize the number of to-do items accomplished is that you can trick yourself into thinking that the to-do items are the important part.  i want to get better about this as i am, uh, \"in my late twenties.\"\n\nmostly, though, i catch myself happy, and i do what Vonnegut tells me to do:\n\n\u003e And I urge you to please notice when you are happy, and exclaim or murmur or think at some point, 'If this isn't nice, I don't know what is.'\n\ni could list some examples, but that seems unnecessary.  here is just one: my partner an i made halal cart chicken a few weekends ago, in the aforementioned New House, and it was the best i think i had felt in three years.  we ate it while watching a terrifically inconsequential show on interior design and drinking martinis; we went to bed at 10pm.\n\ni'm going to bed earlier and earlier; i'm going to bed happier and happier.\n\n[^1]: my most recent post was about [turning 25](https://jmduke.com/2017/09/03/turning-25)","date":"2019-08-30"},{"id":"reces5VAuKb4TgMGq","name":"2018 in review","definition":"Okay, let's skip the whole \"gee, it's been a whole year, huh? this time last year I was...\" and get into it.\n\n### What worked\n\nSo, all the good stuff first:\n\n1. I started writing poetry again.  This is, honestly, the best: I forgot how much I needed a creative outlet, and how much sanity and satisfaction it affords me.\n2. I started running seriously!  I ran my first 10K (and then broke my PR a half dozen times, and am now addicted to middle-distance running.) . I am not a fast runner, nor a particularly graceful one, but crossing finish lines is consistently the happiest I've ever felt.\n3. I started the best job in my life. [^1] . Working at Stripe has put me in close proximity with more friendly, earnest, and talented folks than ever before, and I find myself learning and building awesome things.\n4. I read the most I've read since graduating, a feat which necessitated (fortunately and unfortunately) becoming a big ol' audiobook nerd.  (More about that later.)\n5. [Buttondown](https://buttondown.email) continues to grow.  It's crossed the vaunted four-digit MRR mark, and it sends hundreds of thousands of emails every month.  Neat!  And terrifying!\n6. I finally became a morning person and have some actual morning and evening routines.  (It only took me being out of college for...five years.) . As I wrote in an email recently, my routine sounds like a parody of \"here's what you need to do to be successful\" puff pieces on Business Insider, but getting my emails and my workout and my various administrative obligations done by 8am every day has been a game-changer.\n7. The blasé but earnest capper: I continue to be surrounded by loving friends and loving family, who have all stayed universally healthy.\n\n### What didn't\n\n1. It is hard for me to remember the first three or so months of 2018, but it wasn't great [^2].  I remember playing a lot of *Persona 4: Golden*, and lifting, and learning how to navigate a new personal space (being single for the first time in a while). I gained like twenty pounds.  It was kinda rough, and I consciously knew I needed a change.\n2. I still haven't really figured out the work-life balance thing, though I keep on trying.  Starting in around April, Buttondown *took off* to the extent that it became a net-negative on my well-being in terms of how much stress it brought me versus how much joy it brought me.  It's right around that midpoint again (thanks to an emphasis on nuking tech debt, improving operational efficiency, and just taking some time off) but I want to get it back to a positive place.\n3. I didn't watch that many movies!  I wanted to, but didn't.  This sounds trivial, but it feels vaguely symbolic for me: I think the fact that I was consistently unable to take two hours out of my evening and go to the theatre is a failure case.\n\n### Books\n\nI read a lot of stuff I *loved* this year.  My absolute favorites:\n\n1. **Emily Wilson's *The Odyssey***, a striking and modern translation.\n2. **Anne Carson's *Autobiography of Red***, a verse novel about myth, pain and perspective.\n3. **Italo Calvino's *If On A Winter's Night A Traveler***, a beautiful and often hilarious postmodern treatise on the act of reading and succumbing to fiction.\n4. **Emily Ruskovich's *Idaho***, a lyric narrative about memory, loss, and absence.\n\nOn my completely arbitrary reduce-all-artistic-merit-to-a-five-point-scale rubric that I've been using since ~2010, all of these are are fives.  And I've only have ten fives in the past ten years.  I think explaining why I find a given book life-changing is fairly arbitrary, but all four of these deal fairly closely with how we define ourselves in relation to our environment and our art which I think is neat!\n\nThe other stuff I read, in roughly descending order of how much I liked it (excluding poetry, of which I read a blessed forty-seven books this year):\n\n- *Invisible Cities*\n- *The Iliad*\n- *Sapiens*\n- *Kitchen Confidential*\n- *Circe*\n- *Hard-Boiled Wonderland*\n- *Sense \u0026 Sensibility*\n- *The Postman Always Rings Twice*\n- *A Gentleman in Moscow*\n- *London Fields*\n- *Little Labors*\n- *The Fire Next Time*\n- *I, Claudius*\n- *The Checklist Manifesto*\n- *Convenience Store Woman*\n- *Flash Boys*\n- *The Aeneid*\n- *Transit*\n- *Rabbit, Run*\n- *The Beautiful Struggle*\n- *The Coming Storm*\n- *Last Words from Montmartre*\n- *The Paper Menagerie and Other Stories*\n- *The Little Book of Hygge*\n- *Debt: The First 5000 Years*\n- *Meditations of Marcus Aurelius*\n\n### Even More Content!\n\nI focused more on books than, uh, anything else this year, but the five non-book things that I truly loved:\n\n1. **[Gris](https://www.nintendo.com/en_CA/games/detail/gris-switch)**, a game for the Nintendo Switch about loss and growth.  If you own a Switch, buy and play this game: it is like fifteen dollars and four hours long and very beautiful.\n2. **Legend of Zelda: A Link To The Past**.  I think this is one of the few remaining games from my childhood that Adult Justin owed it to Child Justin to beat.  It was lovely! (Though not as lovely as *Link's Awakening* in terms of nostalgia and childlike-sense-of-wonder.)\n3. **Phantom Thread**.  This was in 2018? Wow.  Still my favorite movie I saw this year, though.\n4. **[DAYTONA](https://open.spotify.com/album/07bIdDDe3I3hhWpxU6tuBp)**.  The greatest workout album of... all time?\n5. **[Anne](https://open.spotify.com/album/3Azclf786vim7jMEXfDceG)**. My favorite album of the year.\n\n(Honorable mentions go to the new 1975 record, *‌Le Monde d'Edena*, and *What Work Is*.)\n\n### Next Year\n\n*I've got some resolutions.*  I love resolutions.  I never stick to them, but they're fun anyway.\n\n1. **Spend two weeks in Japan**. I didn't travel outside the country in 2018 which was a huge bummer.  I want to be a stereotypical white tech dude who visits (and falls in love with) Tokyo *so badly*.  This is gonna be the year.\n2. **Read *War and Peace***.  Twelve hundred and twenty five pages of Tsarist angst.  This will probably take me.... three months, at a conservative twenty pages per day?\n3. **Score 200 on the [APFT](https://en.wikipedia.org/wiki/United_States_Army_Physical_Fitness_Test)**. This is probably my easiest resolution; I think I could handle it now if you give me an entire gram of caffeine and earphones playing *DAYTONA* at an adequately loud volume.  Fifty pushups (in two minutes), sixty pushups (in two minutes), and a 15:00 two-mile time should do it.\n4. **Run a half-marathon**.  This one is much more terrifying!\n5. **Get Spoonbill breakeven**. This is my only technology/career/hustle-related resolution, and it's less out of ambition and more out of, uh, financial prudence.  Spoonbill has gotten me a couple nice write-ups and some lovely email exchanges but it's also been costing me around ~$150 a month for the past year, which threatens to double as the database grows.  I want it merely at breakeven, which might be as simple as imploring some of the VCs who use it to donate to a Patreon or find some AWS credits or something.\n6. **Publish poetry under my own name**. AHHHH THIS IS TERRIFYING\n\n### Thanks\n\nIt is easy, I think, to look at the slow whirlpool of global chaos and disparage 2018 (or perhaps all of the present time) as the year in which many bad things happened. But I am happy and better for having lived through of it, which is a privilege for which I'm thankful.\n\nSalud!  See y'all in 2019.  (I'll try and write more, as always.)\n\n[^1]: [We're hiring.](https://stripe.com/jobs#openings)\n[^2]: I have terrible middle-term memory.  Well, and short- and long-term memory, too.","date":"2018-12-31"},{"id":"rec2ecIHXxYWV6k4y","name":"2016 in review","definition":"Welp.\n\n2016 was a doozy.\n\nThere were lot of very good things. I started the best job of my life; I started living with my partner, and have never been happier; I'm in the best shape of my life.  I listened to a lot of great music, and ate multiple salads. (This sounds boastful, because it is, but I'm trying to be more honest about victories and defeats.)\n\nThere's also, you know, the macro part of 2016.  Where, to be brief (because I'm not capable or insightful enough to put an interesting spin on things), **very bad things happened.**\n\n2016 has made me feel good and bad.  The good parts felt standard; the bad parts felt wholly new.\n\nIt is hard to reconcile a personal, immediate happiness and contentment with a shattered faith in institutions and basic understandings about the world.\n\nSo, largely, I haven't tried to!\n\nAfter a few weeks of general existential malaise I've worked harder than usual.  Part of this is coping mechanism -- work to distract from *actual things* -- but largely this is because I think this felt like the most natural way to produce something of value, to try and offset the bad things, to compartmentalize. [^3]\n\nAnyway, every December I sit down in my grandparents' den and think about the year that's passed and think about the year ahead.  So that's what I'm doing, because solipsism can be productive.\n\nAnd this year, I don't really have any takeaways or through lines?  I know what was good.  I know what was bad.  Further analysis seems pointless.\n\nWhat I want to do more of next year is the same thing I tell myself every year: read more, write more, and work more meaningfully.\n\nGoals are supposed to be concrete and measurable, so you can actually compare your progress against your objectives and all of that.  So here are the specific things:\n\n- **Read 24 books.**\n- **Publish 500 words a week.** [^1]\n- **Hit $2000 in monthly recurring profit.** [^2]\n\nI know these goals are cliche.  I don't think I'll make them (though I hope to).  It just feels necessary -- to have some sort of North Star, to try and be better.\n\nI hope you are well.  I hope you have a good year.\n\n[^1]: I know a week is a cop-out, since most people do that every day.  But I'm more mindful of what I write at this point, and also there's *no way* I carry through with 500 words a day. \n\n[^2]: I've been writing more about my side business, Village Blacksmith.  You can see the monthly review I wrote in [November](villageblacksmith.consulting/november-2016), and I'm in the process of writing December's.\n\n[^3]: It goes without saying that there is *tremendous privilege* in the ability to compartmentalize at all.  I'm an agnostic white dude in tech: none of my immediate comforts or livelihoods are in danger.","date":"2016-12-31"},{"id":"recXXtOiEoSQqSnmD","name":"Being 22, in review","definition":"\u003cp\u003eI turned 23 yesterday. It was cool.\u003c/p\u003e\n\n\n\u003cp\u003eI wanted to think about all the stuff I learned and did when I was 22. Looking through what I said I learned \u003ca href=\"http://jmduke.com/posts/21/\"\u003elast year\u003c/a\u003e, I was kinda shocked how well it kept up: my love for Manhattans, stouts, Chipotle, Murakami, and Threes has only grown.\u003c/p\u003e\n\n\n\u003cp\u003eWhat did I do this year?  What did I learn this year?\u003c/p\u003e\n\n\n\u003cul\u003e\n\u003cli\u003eI started \u003ca href=\"/posts/dieter-rams-15-questions/\"\u003ecaring\u003c/a\u003e a \u003ca href=\"/posts/two-weeks-with-the-apple-watch/\"\u003elot\u003c/a\u003e \u003ca href=\"/posts/two-weeks-with-the-amazon-echo/\"\u003emore\u003c/a\u003e about technology and design.\u003c/li\u003e\n\u003cli\u003eI started going to a climbing gym.  Climbing gyms are great.  I’m pretty awful at climbing, but I’m less awful than I was six months ago, and even less awful than I was six days ago.\u003c/li\u003e\n\u003cli\u003eI figured out how to cook \u003cem\u003esous vide\u003c/em\u003e.\u003c/li\u003e\n\u003cli\u003eI figured out how to pronounce \u003cem\u003esous vide\u003c/em\u003e.\u003c/li\u003e\n\u003cli\u003eI fell in love with Ta-ku and Hemingway and Swift.\u003c/li\u003e\n\u003cli\u003eI made a lot of stuff!  Like, I worked a lot. \u003csup class=\"footnote-ref\" id=\"fnref:1\"\u003e\u003ca href=\"#fn:1\" rel=\"footnote\"\u003e1\u003c/a\u003e\u003c/sup\u003e  Work, to me, is a weird thing – I think I’ve internalized the endorphin rush of productivity to the point where I feel too guilty to spend an evening without tinkering with a side project or working on a freelance thing.  At some point, I think this crossed the line of “great work ethic” into “unhealthy workaholism”.\u003cbr/\u003e\u003c/li\u003e\n\u003cli\u003eSince that last one sounded like a little bit of a downer, I should suffix it with this: I learned how to be really, really proud of the things I do.  After a childhood \u003csup class=\"footnote-ref\" id=\"fnref:2\"\u003e\u003ca href=\"#fn:2\" rel=\"footnote\"\u003e2\u003c/a\u003e\u003c/sup\u003e squandered more than it should have by Halo 2 et al, I can’t remember ever having so many days where I went to bed wholly excited about what I had done and what I’d be doing the next day.\u003c/li\u003e\n\u003cli\u003eI went to Stockholm and Bangkok and surprisingly did not die in either place.\u003cbr/\u003e\u003c/li\u003e\n\u003cli\u003eI read a lot.  I didn’t write enough.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\u003cp\u003eBut the number one thing I keep learning time and time again, is the same thing I wrote last year:\u003c/p\u003e\n\n\n\u003cul\u003e\n\u003cli\u003eI was born into a tremendous, tremendous amount of luck, and it seems to increase at an incredible rate.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\u003cp\u003eI’m going to leave my big resolutions for the end of this year, but if 22 was marked by learning how to work hard and produce results, I want 23 to be marked by learning how to keep healthy.  (Which, tbh, will be a lot of hard work in of itself.  But at least I’m trying!)  Balance is something I’ve never been good at, but I want to change that.\u003c/p\u003e\n\n\n\u003cdiv class=\"footnotes\"\u003e\n\u003chr/\u003e\n\u003col\u003e\n\u003cli id=\"fn:1\"\u003eWhile I’ve made a personal promise to not talk about ~\u003cem\u003e~ the Amazon stuff ~\u003c/em\u003e~ for the foreseeable future, rest assured that I have never cried at my desk or been backstabbed by anonymous feedback.\n \u003ca class=\"footnote-return\" href=\"#fnref:1\"\u003e\u003csup\u003e[return]\u003c/sup\u003e\u003c/a\u003e\u003c/li\u003e\n\u003cli id=\"fn:2\"\u003eI say “childhood” but I just bought Rocket League, so there’s a little bit of relapse going on here.\n \u003ca class=\"footnote-return\" href=\"#fnref:2\"\u003e\u003csup\u003e[return]\u003c/sup\u003e\u003c/a\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\u003c/div\u003e","date":"2015-08-30"},{"id":"recC4lEviGY1Jm3J3","name":"Being 23, in review","definition":"\u003cp\u003eI turned 24 a couple days ago.\u003c/p\u003e\n\n\n\u003cp\u003eHere is where I’m at:\u003c/p\u003e\n\n\n\u003cp\u003eI said \u003ca href=\"http://jmduke.com/posts/22/\"\u003elast year\u003c/a\u003e I wanted to be better at balance.  I’ve gotten better — but I’m still not quite there.  It still feels like every hour I spend not working or improving is wasted.\u003c/p\u003e\n\n\n\u003cp\u003eI’ve been reading more.  I’ve been writing more, too — but not publishing enough.  (This is the part where I say I’ll change that — and I want to! — but I probably won’t.  I’ve become less selective with what I write but more selective with what I publish.)\u003c/p\u003e\n\n\n\u003cp\u003eI left the best job I’ve ever had to take an even better one.  This is still mostly terrifying, but in a good way: the same way I was terrified the first month of college, the same way I was terrified the first month of Seattle.  I think small, periodic doses of terror are generally a sign that I’m going in the right direction into uncharted territory.\u003c/p\u003e\n\n\n\u003cp\u003eLast week, my partner moved in with me.  We survived Ikea.  I helped her install shelves above her ergonomic desk; we engaged in furious debate about where the picnic table belongs.  Things are very good.  We have bought plants; we plan to buy more plants.\u003c/p\u003e\n\n\n\u003cp\u003eMy two happiest moments of being 23: sitting at an anonymous bar in Florence with my best friend, sipping a pair of negronis and idly munching on a tray of chips; trespassing into a private beach with a faux lighthouse with my partner in an ultimately unsuccessful attempt to catch a Magikarp.\u003c/p\u003e\n\n\n\u003cp\u003eI spent the past few weeks playing Chrono Trigger, a game I started when I was 8 years old and never finished.  It is a better game than I realized when I was a kid: it is a game about the things time does to us, and the ways we change over a journey.\u003c/p\u003e\n\n\n\u003cp\u003eI finished the game yesterday, after starting it sixteen years ago.  It feels important to finish these games I started a long time ago.  It feels important to carry these things through to conclusion.\u003c/p\u003e\n\n\n\u003cp\u003eI am looking at a couple boxes of old things sitting in the corner of my living room, waiting to be carried to the recycling bin or Goodwill or wherever you’re supposed to dispose of electronics: some games, some books, some clothes, an Xbox, a rat’s king of wires and controllers, a few knit ties.  Some of these things are not important enough to keep; some of these things are too important to keep.  I am usually liberal with what I throw away, but in this most recent move into a new apartment I have been very liberal, as if finally admitting that I’ll probably never reread my copy of \u003cem\u003eOur Mutual Friend\u003c/em\u003e or really need to wear a bow tie more than once every few years.  These admissions are healthy, but still feel like they carry some weight to them.\u003c/p\u003e\n\n\n\u003cp\u003eIf 24 is like the tail end of 23, it is like this:\u003c/p\u003e\n\n\n\u003cp\u003eThe days are getting shorter; the nights are getting shorter.  I am going to bed more tired and more happy.  I am remembering to take my vitamins; I am remembering to water my plants.  I own stamps and scotch and a bathrobe.  I still drink the occassional red bull vodka, but I also eat the occassional salad. Little by little, I am becoming an adult, like tiny freckles of maturity are starting to bloom across my back.\u003c/p\u003e\n\n\n\u003cp\u003eBut some parts of me are refusing to change: I still wear sandals in inappropriate weather.  I still cannot resist the urge to redesign my website every few months (check back in a couple weeks for that).\u003c/p\u003e\n\n\n\u003cp\u003eI am still, after all these years, playing Chrono Trigger, and losing myself in the Kingdom of Zeal.\u003c/p\u003e\n\n\n\u003cp\u003eIf 24 is like today, it is like this:\u003c/p\u003e\n\n\n\u003cp\u003eIt is fall in Seattle.  It has been crisp for the past few days.  This morning I had to dig out a box of sweaters, and put on my first cardigan of the season.  My partner and I took turns commandeering the Aeropress, and I spent the morning idly shopping for new slippers.  I have to go to the gym soon, but for now I am listening to Dntel and writing and feeling very much at peace.\u003c/p\u003e\n\n\n\u003cp\u003eI hope you’re doing well, too.\u003c/p\u003e\n\t","date":"2016-08-30"},{"id":"rec9RX9MRJ7qRaqax","name":"Being 24, in review","definition":"\u003cp\u003eThis week, I turned 25.\u003c/p\u003e\n\n\n\u003cp\u003eI spent my birthday doing the thing I want to spend every birthday doing: I reverse seared a filet, bought a nice scotch, and watched an old movie with Molly.\u003c/p\u003e\n\n\n\u003cp\u003eWe were going to watch \u003cem\u003eBridge on the River Kwoi\u003c/em\u003e but didn’t want to start a three-hour movie at eight pm, so we watched \u003cem\u003eThe African Queen\u003c/em\u003e.\u003c/p\u003e\n\n\n\u003cp\u003eWe have become so old.  It is fantastic.\u003c/p\u003e\n\n\u003c!--more--\u003e\n\n\n\u003cp\u003eI do the thing I do every time I turn a new age, which is expressly deny the very \u003cem\u003econcept\u003c/em\u003e of maturation until it seeps into my life anyway.\u003c/p\u003e\n\n\n\u003cp\u003eLike grabbing dinner and drinks with a couple friends who had moved out of town but were back for the week, and suddenly understanding that “grabbing dinner and drinks” has become an act that shifted from “order a pizza and go bar-hopping” to “make sandwiches and drink wine”.\u003c/p\u003e\n\n\n\u003cp\u003e(I mean, I still eat pizza, and we still go to bars.  But we eat less pizza, and spend less time in bars, and besides on the week of your birthday you’re forced to wonder how things have changed.)\u003c/p\u003e\n\n\n\u003cp\u003eI am re-reading what I \u003ca href=\"http://jmduke.com/posts/2324/\"\u003ewrote this time last year\u003c/a\u003e, and discovering that most of my thoughts are redundant. I feel more mature but no more wiser.  I feel like I’m getting more rest but am slightly worried about forgetting what it feels like to be restless.\u003c/p\u003e\n\n\n\u003cp\u003eI am waking up early (I referred to waking up at 7 as \u003cem\u003esleeping in\u003c/em\u003e); I am eating well.  I find myself so tired at the day, but it’s an earned fatigue (to steal a friend’s phrase.). I am reading and writing and learning French, conjugated word by conjugated word.  I can deadlift more than I could deadlift twelve months ago.  I beat \u003cem\u003ePersona 5\u003c/em\u003e.\u003c/p\u003e\n\n\n\u003cp\u003eAnd I’m happy.  Really, really happy.  If there’s something that I’m unhappy about, it’s that the days are short and the weeks are short and the months are the shortest of all.\u003c/p\u003e\n\n\n\u003cp\u003eWe’re going to DC in a few weeks, and then after that Paris, and then after that we need to plan our next trip — Tokyo, maybe, or Edinburgh or Prague.  And then after that, maybe Little Rock.  I have always wanted to visit Little Rock, for reasons unexplainable.\u003c/p\u003e\n\n\n\u003cp\u003eThere is still so much to discover.\u003c/p\u003e\n\n\n\u003cp\u003e\u003c/p\u003e\n\t","date":"2017-08-30"},{"id":"recyeqayqjSF6GlXT","name":"Being 21, in review","definition":"\u003cp\u003eAn abridged list of things I have learned in the past year – the unabridged one is a lot longer, I promise, but I culled it for the exciting stuff (which means you’re missing out on like four dozen obscure Java patterns, so it’s for the best):\u003c/p\u003e\n\n\n\u003cul\u003e\n\u003cli\u003eTime flies when you don’t have the convenient demarcations of semesters and midterms to keep you grounded.  (Thankfully, two-week sprints tend to alleviate this somewhat.)  You wake up one morning and it’s August 2013, and then it’s August 2014 and you are unsure of what just happened.\u003c/li\u003e\n\u003cli\u003eThere is no better way to spend a Sunday morning than getting to La Panier right when it opens, getting a fresh amandine and an americano and something to read, and watching the rest of the world wake up.\u003c/li\u003e\n\u003cli\u003eInstalling a sixty-foot whiteboard on my wall is the best $20 I will ever spend.\u003c/li\u003e\n\u003cli\u003eManhattans are delicious.\u003c/li\u003e\n\u003cli\u003eBut not as delicious as a good \u003ca href=\"http://www.beeradvocate.com/beer/profile/700/80740/\"\u003emilk stout\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003eCooking is science that you can eat and it is the best thing.\u003c/li\u003e\n\u003cli\u003eAn equation to graph my monthly Chipotle consumption as a function of how many blocks away the closest location is: \u003ccode\u003ef(x) = -.429x + 6.28\u003c/code\u003e; when the closest one is ten blocks away (\u003ccode\u003ex=10\u003c/code\u003e), I’ll only eat there twice a month.  When they opened one in South Lake Union that was three blocks away from my office, the number jumps up to five times a month.  \u003csup class=\"footnote-ref\" id=\"fnref:1\"\u003e\u003ca href=\"#fn:1\" rel=\"footnote\"\u003e1\u003c/a\u003e\u003c/sup\u003e\u003c/li\u003e\n\u003cli\u003eMFDOOM is the best.  Ella Fitzgerald is the best.  Haruki Murakami is the best.  Sharon Olds is the best.\u003c/li\u003e\n\u003cli\u003eTattoos don’t hurt nearly as much as expected \u003csup class=\"footnote-ref\" id=\"fnref:2\"\u003e\u003ca href=\"#fn:2\" rel=\"footnote\"\u003e2\u003c/a\u003e\u003c/sup\u003e, especially when you have someone’s hand to hold/crush.\u003c/li\u003e\n\u003cli\u003eIt is optimal to \u003ca href=\"http://jmduke.com/posts/idk/\"\u003eadmit you don’t know shit\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003eI will never stop playing Threes until I delete it from my phone.\u003c/li\u003e\n\u003cli\u003eI will never delete Threes from my phone.\u003c/li\u003e\n\u003cli\u003eI read too few books and too much everything else.  (I’m \u003ca href=\"https://www.goodreads.com/review/list/34530762-justin-duke\"\u003eworking on this\u003c/a\u003e, though!)\u003c/li\u003e\n\u003cli\u003eThe most valuable – and, apparently, rarest – part of my college education was the ability to send emails well.\u003c/li\u003e\n\u003cli\u003eIceland is gorgeous, and I need to travel more.\u003c/li\u003e\n\u003cli\u003eI was born into a tremendous, tremendous amount of luck, and it seems to increase at an incredible rate.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\u003cp\u003eThe list for 22 has already started.  I’m hoping it has more things learned in foreign countries and less things about Chipotle \u003csup class=\"footnote-ref\" id=\"fnref:3\"\u003e\u003ca href=\"#fn:3\" rel=\"footnote\"\u003e3\u003c/a\u003e\u003c/sup\u003e.\u003c/p\u003e\n\n\n\u003cdiv class=\"footnotes\"\u003e\n\u003chr/\u003e\n\u003col\u003e\n\u003cli id=\"fn:1\"\u003eOf course, this equation asserts that if there’s a Chipotle on my block (\u003ccode\u003ex=0\u003c/code\u003e) I’ll cap out at a mere \u003ccode\u003e6.28\u003c/code\u003e, which is an obvious lowball.\n \u003ca class=\"footnote-return\" href=\"#fnref:1\"\u003e\u003csup\u003e[return]\u003c/sup\u003e\u003c/a\u003e\u003c/li\u003e\n\u003cli id=\"fn:2\"\u003eSorry, Mom and Dad.\n \u003ca class=\"footnote-return\" href=\"#fnref:2\"\u003e\u003csup\u003e[return]\u003c/sup\u003e\u003c/a\u003e\u003c/li\u003e\n\u003cli id=\"fn:3\"\u003eThat’s a lie.  I would never hope for less Chipotle.\n \u003ca class=\"footnote-return\" href=\"#fnref:3\"\u003e\u003csup\u003e[return]\u003c/sup\u003e\u003c/a\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\u003c/div\u003e\n","date":"2014-08-30"},{"id":"recx7ZhJvBrx1flZ3","name":"2014, in review","definition":"\u003cp\u003eI read a lot of Murakami this year.  I read \u003cem\u003eKafka on the Shore\u003c/em\u003e, then I read \u003cem\u003eThe Wind Up Bird Chronicle\u003c/em\u003e, then I read \u003cem\u003eColorless Tsukuru Tazaki\u003c/em\u003e, then I read \u003cem\u003eNorweigan Wood\u003c/em\u003e.  He’s now one of my favorite authors. There are two big moments that he gave me:\u003c/p\u003e\n\n\n\u003cul\u003e\n\u003cli\u003eBarreling down a thin highway in Krabi, Thailand, packed like a sardine in a random van, my backpack pressed against my kness pressed against my chest like some sort of tourist panini, feverishly reading \u003cem\u003eWind Up\u003c/em\u003e.  Never had five hours felt more like five minutes.\u003c/li\u003e\n\u003cli\u003eWaiting for the bus on a rainy night in Fremont, a little tipsy and a little homesick, reading \u003cem\u003eColorless Tsukuru\u003c/em\u003e, finding this passage:\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“That amazing time in our lives is gone, and will never return. All the beautiful possibilities we had then have been swallowed up in the flow of time.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\u003cp\u003eUrban ennui is kind of Murakami’s shtick, and \u003cem\u003eColorless\u003c/em\u003e doubled down on this worry that as we grow older, we might grow wiser and more experienced but the universe of possibilities dwindles, never to recover.\u003c/p\u003e\n\n\n\u003cp\u003eMaybe it’s that this was the first full year away from college, but I get that sense that the number of big choices and possibilities in my life is on an increasing decline.  This is not to say that I’m unhappy with where I am or what I’m doing (because trust me, I’m totally pumped), but I think there’s an inherent value in serendipity.\u003c/p\u003e\n\n\n\u003cp\u003eOne of my favorite things about college was the sense that I could wake up and anything could happen, and I got that feeling too for the first six months that was in Seattle – don’t get me wrong, I still love Seattle, but I think I know it too well now, I know all the shops in Belltown and the regulars at \u003cem\u003eThe Upstairs\u003c/em\u003e and \u003cem\u003eUptown Espresso\u003c/em\u003e and there are so few days that don’t go according to plan.\u003c/p\u003e\n\n\n\u003cp\u003eBut that’s getting away from my point, which is this: Murakami left a taste in my mouth.  There aren’t any climactic moments in his books \u003csup class=\"footnote-ref\" id=\"fnref:1\"\u003e\u003ca href=\"#fn:1\" rel=\"footnote\"\u003e1\u003c/a\u003e\u003c/sup\u003e – they tend to leave me a little awash and changed, like somehow I finished the book and all the things in my apartment are placed a little bit more differently than they used to be.  His work taught me some things about what I look for in the world – and myself – and I think that’s important.\u003c/p\u003e\n\n\n\u003ch3 id=\"the-year-of-cocktails\"\u003eThe year of cocktails\u003c/h3\u003e\n\n\n\u003cp\u003eI spent more of my free time working on \u003ca href=\"http://getbarback.com\"\u003eBarback\u003c/a\u003e than any other specific thing.  I’ve written at length about the nitty gritty, but one of the things that I hadn’t really noticed until writing this is that it’s the first thing that I’ve actually committed to for more than a couple months. Most of my random side projects I would either abandon in a fit of boredom after a couple of weeks, but this one has stuck, and it’s been awesome and totally fulfilling.\u003c/p\u003e\n\n\n\u003cp\u003eA positive thing happened last month: Barback started doing really, \u003cem\u003ereally\u003c/em\u003e well.  It was in the Top 10 for Food and Drink for a while, which was obviously nice from a monetary standpoint but it also just made me so proud.  I know, it sounds dumb, but validation for one’s work is a big thing that drives me and getting to stand back and be like: \u003cem\u003eHey, this thing I made is succeeding\u003c/em\u003e was pretty neat.\u003c/p\u003e\n\n\n\u003cp\u003eThat’s probably the best that programming has ever made me feel.  Maybe the best that working in general has ever made me feel.  Not really sure what that means, but I think 2015 is going to have a lot of cocktails.\u003c/p\u003e\n\n\n\u003cp\u003e(Also, \u003cem\u003eI have to make sure the recipe is good\u003c/em\u003e is the best reason ever to make a drink.)\u003c/p\u003e\n\n\n\u003ch3 id=\"the-year-of-habits\"\u003eThe year of habits\u003c/h3\u003e\n\n\n\u003cp\u003eEvery week for the past thirty weeks or so, I do the following things:\u003c/p\u003e\n\n\n\u003cul\u003e\n\u003cli\u003eVacuum\u003c/li\u003e\n\u003cli\u003eListen to a new album\u003c/li\u003e\n\u003cli\u003eRead a new book\u003c/li\u003e\n\u003cli\u003eWatch a new movie\u003c/li\u003e\n\u003cli\u003eCook a new recipe\u003c/li\u003e\n\u003cli\u003ePlay with a new app\u003c/li\u003e\n\u003cli\u003eGo to a new place\u003c/li\u003e\n\u003cli\u003eWrite a new blog post\u003c/li\u003e\n\u003cli\u003eLearn a new thing \u003csup class=\"footnote-ref\" id=\"fnref:2\"\u003e\u003ca href=\"#fn:2\" rel=\"footnote\"\u003e2\u003c/a\u003e\u003c/sup\u003e\u003c/li\u003e\n\u003cli\u003eRun twice\u003c/li\u003e\n\u003cli\u003eLift twice\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\u003cp\u003eI have become addicted to novelty and progress.  I like the rhythm of these things: I like the feeling of gradual advancement it gives me, as if I’m playing a character in a video game and slowly levelling up all my skills with patience and diligence.  Sometimes I worry it distracts me from progress in other things, but looking back at the number of highlights on \u003ccode\u003ekindle.amazon.com\u003c/code\u003e I think I spend my time well. \u003csup class=\"footnote-ref\" id=\"fnref:5\"\u003e\u003ca href=\"#fn:5\" rel=\"footnote\"\u003e3\u003c/a\u003e\u003c/sup\u003e\u003c/p\u003e\n\n\n\u003cp\u003eIt took me lots of time, Expo ink, and stickies to get into the habit of these things.  I am perhaps too pleased with myself for the fact that I can actually fry chicken, but it’s still a thing I hang my hat on.\u003c/p\u003e\n\n\n\u003ch3 id=\"2014-in-a-nutshell\"\u003e2014, in a nutshell\u003c/h3\u003e\n\n\n\u003cp\u003eI did lots of things, got better at lots of things, and probably drank a little too much.  There weren’t enough surprises, but it was a wonderful twelve months.\u003c/p\u003e\n\n\n\u003ch3 id=\"the-next-year\"\u003eThe next year\u003c/h3\u003e\n\n\n\u003cp\u003eI ended this post last year with a list of goals, and the two of them that I actually accomplished (travelling and making an app) were pretty fantastic.  In that vein, I’m gonna set myself up with another three:\u003c/p\u003e\n\n\n\u003cul\u003e\n\u003cli\u003eRun a half-marathon\u003c/li\u003e\n\u003cli\u003eThree more countries \u003csup class=\"footnote-ref\" id=\"fnref:4\"\u003e\u003ca href=\"#fn:4\" rel=\"footnote\"\u003e4\u003c/a\u003e\u003c/sup\u003e\u003c/li\u003e\n\u003cli\u003eWrite and publish a technical book \u003csup class=\"footnote-ref\" id=\"fnref:3\"\u003e\u003ca href=\"#fn:3\" rel=\"footnote\"\u003e5\u003c/a\u003e\u003c/sup\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\u003cp\u003eAnd, as always:\u003c/p\u003e\n\n\n\u003cul\u003e\n\u003cli\u003eBe happy, healthy, and honest\u003c/li\u003e\n\u003cli\u003eWork and think hard\u003c/li\u003e\n\u003cli\u003eNever, ever, ever be bored\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\u003cp\u003e(I know this whole ‘writing out your values’ thing is nerdy as all hell, but it still felt good to write this.  I’m looking forward to this time next year already.)\u003c/p\u003e\n\n\n\u003cdiv class=\"footnotes\"\u003e\n\u003chr/\u003e\n\u003col\u003e\n\u003cli id=\"fn:1\"\u003eWell, there are, but they’re cloaked in like four layers of symbolism\n \u003ca class=\"footnote-return\" href=\"#fnref:1\"\u003e\u003csup\u003e[return]\u003c/sup\u003e\u003c/a\u003e\u003c/li\u003e\n\u003cli id=\"fn:2\"\u003eThis is usually defined as \u003cem\u003edo a random new language tutorial\u003c/em\u003e or \u003cem\u003edo a week in a Coursera course\u003c/em\u003e\n\u003ca class=\"footnote-return\" href=\"#fnref:2\"\u003e\u003csup\u003e[return]\u003c/sup\u003e\u003c/a\u003e\u003c/li\u003e\n\u003cli id=\"fn:5\"\u003eIt straight up boggles my mind that I used to spend four hours a day in front of a PlayStation.  Then again, I spend half that time recently playing \u003cem\u003eDesert Golfing\u003c/em\u003e…\n \u003ca class=\"footnote-return\" href=\"#fnref:5\"\u003e\u003csup\u003e[return]\u003c/sup\u003e\u003c/a\u003e\u003c/li\u003e\n\u003cli id=\"fn:4\"\u003eFrontrunners: Japan, Spain, Sweden.\n \u003ca class=\"footnote-return\" href=\"#fnref:4\"\u003e\u003csup\u003e[return]\u003c/sup\u003e\u003c/a\u003e\u003c/li\u003e\n\u003cli id=\"fn:3\"\u003eI have thirty pages of \u003cem\u003ePython for Business Majors\u003c/em\u003e somewhere on my laptop, but I’m thinking something a bit more niche.\n \u003ca class=\"footnote-return\" href=\"#fnref:3\"\u003e\u003csup\u003e[return]\u003c/sup\u003e\u003c/a\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\u003c/div\u003e\n","date":"2014-12-31"},{"id":"reckV6uKSVtTOFsro","name":"2020 in review","definition":"You can read about 2020 \u003ca href=\"/years/2020\"\u003ehere\u003c/a\u003e.","date":"2020-12-15"}]